app/views/orders/new.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
---
      <td style="text-align: right;" ><%= ln.count %></td>
      <td style="text-align: right;" ><%= ln.count * ln.product.price %></td>