app/views/products/index.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 3 LIMIT 1
---

<% if logged_in? && current_user.cart.present? && current_user.cart.line_items.present? %>